public/posts/no-sql.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>NoSQL</title>
<meta name="description" content="A comprehensive Emacs Lisp guide covering Elisp fundamentals, Emacs internals, package development, macros, debugging, performance optimization, asynchronous programming, and advanced editor extension development." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/static/css/style.css" type="text/css"/>
<link rel="stylesheet" href="/static/css/style.css" type="text/css"/>
<link rel="stylesheet" href="/static/css/style.css" type="text/css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">NoSQL</h1>
</header><div class="site-header">
  <div class="site-title"><a href="/">Borislav Dostumski</a></div>
  <nav class="site-nav">
    <a href="/index.html">Index</a>
    <a href="/certificates.html">Certificates</a>
    <a href="/blog.html">Blog</a>
    <a href="/about.html">Bio</a>
  </nav>
</div>
<div id="outline-container-orga188063" class="outline-2">
<h2 id="orga188063">NoSQL Q&amp;A (Beginner to Advanced)</h2>
</div>

<div id="outline-container-orgafb800a" class="outline-2">
<h2 id="orgafb800a">Fundamentals</h2>
<div class="outline-text-2" id="text-orgafb800a">
</div>
<div id="outline-container-org0069cd5" class="outline-3">
<h3 id="org0069cd5">Q1. What is NoSQL?</h3>
<div class="outline-text-3" id="text-org0069cd5">
<p>
"NoSQL" ("Not Only SQL") is a broad family of non-relational databases designed
for large-scale, flexible-schema, and distributed workloads. They relax some
relational guarantees (joins, fixed schema, strong consistency) in exchange for
scalability, flexibility, and availability.
</p>
</div>
</div>
<div id="outline-container-org7908581" class="outline-3">
<h3 id="org7908581">Q2. What are the main categories of NoSQL databases?</h3>
<div class="outline-text-3" id="text-org7908581">
<ul class="org-ul">
<li><b>Document</b> stores: MongoDB, Couchbase</li>
<li><b>Key-Value</b> stores: Redis, DynamoDB, Riak</li>
<li><b>Wide-Column</b> (column-family) stores: Cassandra, HBase, ScyllaDB</li>
<li><b>Graph</b> databases: Neo4j, JanusGraph, Amazon Neptune</li>
<li>(Sometimes added: search engines like Elasticsearch, time-series like InfluxDB)</li>
</ul>
</div>
</div>
<div id="outline-container-org3e6d3aa" class="outline-3">
<h3 id="org3e6d3aa">Q3. How does NoSQL differ from relational (SQL) databases?</h3>
<div class="outline-text-3" id="text-org3e6d3aa">
<p>
Relational DBs use fixed schemas, tables/rows, SQL, joins, and strong ACID
guarantees. NoSQL typically uses flexible schemas, varied data models, horizontal
scaling, denormalization over joins, and often eventual consistency.
</p>
</div>
</div>
<div id="outline-container-orgbe4d2cf" class="outline-3">
<h3 id="orgbe4d2cf">Q4. When should you choose NoSQL over a relational database?</h3>
<div class="outline-text-3" id="text-orgbe4d2cf">
<p>
When you need horizontal scale, high write throughput, flexible/evolving schemas,
large unstructured data, low-latency key lookups, or specific models (graph,
time-series). Avoid it when you need complex multi-entity transactions, ad-hoc
joins, and strong relational integrity.
</p>
</div>
</div>
<div id="outline-container-org3791733" class="outline-3">
<h3 id="org3791733">Q5. What is a document database?</h3>
<div class="outline-text-3" id="text-org3791733">
<p>
A store where records are self-contained documents (usually JSON/BSON), each
holding nested fields and arrays. Documents in a collection need not share the same structure.
</p>
</div>
</div>
<div id="outline-container-orgddd8764" class="outline-3">
<h3 id="orgddd8764">Q6. What is a key-value store?</h3>
<div class="outline-text-3" id="text-orgddd8764">
<p>
The simplest NoSQL model: data is stored as a dictionary of unique keys mapped to
opaque values. Extremely fast for get/put by key; limited query capability beyond the key.
</p>
</div>
</div>
<div id="outline-container-org15ca94c" class="outline-3">
<h3 id="org15ca94c">Q7. What is a wide-column (column-family) store?</h3>
<div class="outline-text-3" id="text-org15ca94c">
<p>
A model storing data in rows identified by a key, where each row can have many
columns grouped into column families. Optimized for huge datasets and high write
throughput (e.g., Cassandra, HBase).
</p>
</div>
</div>
<div id="outline-container-org1d12183" class="outline-3">
<h3 id="org1d12183">Q8. What is a graph database?</h3>
<div class="outline-text-3" id="text-org1d12183">
<p>
A database that models data as nodes (entities) and edges (relationships) with
properties, optimized for traversing connections (social networks, recommendation
engines, fraud detection).
</p>
</div>
</div>
<div id="outline-container-orgc0d8297" class="outline-3">
<h3 id="orgc0d8297">Q9. What is schema-on-read vs schema-on-write?</h3>
<div class="outline-text-3" id="text-orgc0d8297">
<p>
<b>Schema-on-write</b> (relational) validates structure at insert time.
<b>Schema-on-read</b> (many NoSQL) stores data flexibly and interprets structure when
read, pushing schema responsibility to the application.
</p>
</div>
</div>
<div id="outline-container-org6e6daec" class="outline-3">
<h3 id="org6e6daec">Q10. What is denormalization and why is it common in NoSQL?</h3>
<div class="outline-text-3" id="text-org6e6daec">
<p>
Denormalization stores related data together (duplicated) to avoid joins, so a
single read returns everything needed. NoSQL favors it because joins are limited
or absent and read performance/scale is prioritized.
</p>
</div>
</div>
<div id="outline-container-orge29a35e" class="outline-3">
<h3 id="orge29a35e">Q11. What is the CAP theorem?</h3>
<div class="outline-text-3" id="text-orge29a35e">
<p>
In a distributed system you can guarantee at most two of: <b>Consistency</b>,
<b>Availability</b>, <b>Partition tolerance</b>. Since network partitions are unavoidable,
real systems trade Consistency vs Availability during a partition (CP vs AP).
</p>
</div>
</div>
<div id="outline-container-orgf5e5141" class="outline-3">
<h3 id="orgf5e5141">Q12. Give examples of CP and AP systems.</h3>
<div class="outline-text-3" id="text-orgf5e5141">
<p>
CP (consistency over availability): HBase, MongoDB (default), Redis (single
node), Zookeeper. AP (availability over consistency): Cassandra, DynamoDB,
Riak, CouchDB. Note many are tunable.
</p>
</div>
</div>
<div id="outline-container-orgd90b592" class="outline-3">
<h3 id="orgd90b592">Q13. What is the BASE model?</h3>
<div class="outline-text-3" id="text-orgd90b592">
<p>
An alternative to ACID for distributed systems: <b>Basically Available</b>, <b>Soft
state</b>, <b>Eventual consistency</b>. It prioritizes availability and accepts temporary
inconsistency that converges over time.
</p>
</div>
</div>
<div id="outline-container-orgb986791" class="outline-3">
<h3 id="orgb986791">Q14. What is eventual consistency?</h3>
<div class="outline-text-3" id="text-orgb986791">
<p>
A consistency model where, given no new updates, all replicas eventually converge
to the same value. Reads may temporarily return stale data.
</p>
</div>
</div>
<div id="outline-container-orgdb5a2d1" class="outline-3">
<h3 id="orgdb5a2d1">Q15. What is strong consistency?</h3>
<div class="outline-text-3" id="text-orgdb5a2d1">
<p>
A guarantee that any read returns the most recent committed write. Requires
coordination across replicas, typically costing latency or availability.
</p>
</div>
</div>
<div id="outline-container-org4768797" class="outline-3">
<h3 id="org4768797">Q16. What is horizontal vs vertical scaling?</h3>
<div class="outline-text-3" id="text-org4768797">
<p>
<b>Vertical</b> scaling adds resources (CPU/RAM) to one machine. <b>Horizontal</b> scaling
adds more machines and distributes data/load — the NoSQL strength via sharding
and replication.
</p>
</div>
</div>
<div id="outline-container-org2919b69" class="outline-3">
<h3 id="org2919b69">Q17. What is sharding (partitioning)?</h3>
<div class="outline-text-3" id="text-org2919b69">
<p>
Splitting a dataset across multiple nodes by a partition/shard key, so each node
holds a subset. Enables horizontal scale and parallelism.
</p>
</div>
</div>
<div id="outline-container-org648139e" class="outline-3">
<h3 id="org648139e">Q18. What is replication?</h3>
<div class="outline-text-3" id="text-org648139e">
<p>
Maintaining copies of data on multiple nodes for fault tolerance, availability,
and read scaling. Replicas can be synchronous or asynchronous.
</p>
</div>
</div>
<div id="outline-container-orgda2bc01" class="outline-3">
<h3 id="orgda2bc01">Q19. What is the difference between sharding and replication?</h3>
<div class="outline-text-3" id="text-orgda2bc01">
<p>
Sharding splits <b>different</b> data across nodes (scale + capacity). Replication
copies the <b>same</b> data across nodes (availability + durability). Most systems use
both together.
</p>
</div>
</div>
<div id="outline-container-org15c59c1" class="outline-3">
<h3 id="org15c59c1">Q20. Do NoSQL databases support transactions?</h3>
<div class="outline-text-3" id="text-org15c59c1">
<p>
Increasingly yes. Many support atomic single-document/single-key operations
natively; several now offer multi-document/multi-key ACID transactions (MongoDB
4.0+, DynamoDB transactions, FaunaDB), usually with scaling trade-offs.
</p>
</div>
</div>
<div id="outline-container-org7a823e1" class="outline-3">
<h3 id="org7a823e1">Q21. What is a collection / table / keyspace?</h3>
<div class="outline-text-3" id="text-org7a823e1">
<p>
A logical grouping of records: a <b>collection</b> (MongoDB documents), a <b>table</b>
(DynamoDB/Cassandra), within a <b>keyspace</b> (Cassandra) or <b>database</b> (MongoDB).
</p>
</div>
</div>
<div id="outline-container-org166fd89" class="outline-3">
<h3 id="org166fd89">Q22. What is a primary key in NoSQL?</h3>
<div class="outline-text-3" id="text-org166fd89">
<p>
A unique identifier for a record. In key-value/document stores it's a single key;
in wide-column stores it's often composite (partition key + clustering/sort key).
</p>
</div>
</div>
