public/posts/no-sql.html
<div id="outline-container-orgbeef40c" class="outline-3">
<h3 id="orgbeef40c">Q23. What is a partition key vs a sort/clustering key?</h3>
<div class="outline-text-3" id="text-orgbeef40c">
<p>
The <b>partition key</b> determines which node/partition stores the row. The
<b>sort/clustering key</b> orders rows within a partition, enabling range queries
inside it.
</p>
</div>
</div>
<div id="outline-container-orga98631a" class="outline-3">
<h3 id="orga98631a">Q24. What is a TTL (time to live)?</h3>
<div class="outline-text-3" id="text-orga98631a">
<p>
A per-record expiration: the database automatically deletes the item after the
specified time. Common in Redis, Cassandra, and DynamoDB for caches and
ephemeral data.
</p>
</div>
</div>
<div id="outline-container-org40f9cdc" class="outline-3">
<h3 id="org40f9cdc">Q25. What is BSON?</h3>
<div class="outline-text-3" id="text-org40f9cdc">
<p>
Binary JSON — MongoDB's binary-encoded serialization of JSON-like documents,
adding types (ObjectId, Date, Decimal128, binary) and enabling efficient
traversal and storage.
</p>
</div>
</div>
<div id="outline-container-org3d6880c" class="outline-3">
<h3 id="org3d6880c">Q26. What is an ObjectId in MongoDB?</h3>
<div class="outline-text-3" id="text-org3d6880c">
<p>
A 12-byte unique identifier MongoDB generates for the <code>_id</code> field by default. It
encodes a timestamp, machine/process info, and a counter, making it roughly
sortable by creation time.
</p>
</div>
</div>
<div id="outline-container-org456c462" class="outline-3">
<h3 id="org456c462">Q27. What does "polyglot persistence" mean?</h3>
<div class="outline-text-3" id="text-org456c462">
<p>
Using multiple data storage technologies within one system, choosing the best
store per use case (e.g., Redis for caching, MongoDB for catalog, Neo4j for
recommendations).
</p>
</div>
</div>
<div id="outline-container-orgdd0cec6" class="outline-3">
<h3 id="orgdd0cec6">Q28. What is a secondary index?</h3>
<div class="outline-text-3" id="text-orgdd0cec6">
<p>
An index on a non-primary attribute to support queries by fields other than the
primary key. Adds query flexibility at the cost of storage and write overhead.
</p>
</div>
</div>
<div id="outline-container-orgac7e332" class="outline-3">
<h3 id="orgac7e332">Q29. What are the trade-offs of NoSQL?</h3>
<div class="outline-text-3" id="text-orgac7e332">
<p>
Pros: scale, flexibility, performance, availability. Cons: weaker consistency,
limited joins/ad-hoc queries, data duplication, eventual consistency complexity,
and query patterns must be designed upfront.
</p>
</div>
</div>
<div id="outline-container-org1c7474b" class="outline-3">
<h3 id="org1c7474b">Q30. Is NoSQL "schemaless"?</h3>
<div class="outline-text-3" id="text-org1c7474b">
<p>
Not truly — it's <b>flexible schema</b>. The database doesn't enforce structure, but
applications still rely on an implicit schema. Many engines now support optional
schema validation.
</p>
</div>
</div>
</div>
<div id="outline-container-orgb4f1c47" class="outline-2">
<h2 id="orgb4f1c47">Data Modeling</h2>
<div class="outline-text-2" id="text-orgb4f1c47">
</div>
<div id="outline-container-orgf7b78c4" class="outline-3">
<h3 id="orgf7b78c4">Q31. How does NoSQL data modeling differ from relational modeling?</h3>
<div class="outline-text-3" id="text-orgf7b78c4">
<p>
Relational modeling normalizes around entities and relationships first. NoSQL
modeling starts from <b>access patterns</b> (queries) and designs data to serve them
efficiently, often denormalizing and duplicating.
</p>
</div>
</div>
<div id="outline-container-orgce04d51" class="outline-3">
<h3 id="orgce04d51">Q32. What is "query-driven" data modeling?</h3>
<div class="outline-text-3" id="text-orgce04d51">
<p>
Designing your schema based on how data will be read/written rather than its
logical structure. You enumerate access patterns first, then model data so each
pattern is a single efficient operation.
</p>
</div>
</div>
<div id="outline-container-org2de6343" class="outline-3">
<h3 id="org2de6343">Q33. What is embedding vs referencing in document databases?</h3>
<div class="outline-text-3" id="text-org2de6343">
<p>
<b>Embedding</b> nests related data inside a parent document (one read, atomic
updates). <b>Referencing</b> stores related data in separate documents linked by id
(like a foreign key), requiring multiple reads or lookups.
</p>
</div>
</div>
<div id="outline-container-orgd0eb7a9" class="outline-3">
<h3 id="orgd0eb7a9">Q34. When should you embed vs reference?</h3>
<div class="outline-text-3" id="text-orgd0eb7a9">
<p>
Embed for "contains"/one-to-few relationships, data read together, and bounded
size. Reference for many-to-many, unbounded/large growth, frequently-changing
shared data, or when the sub-entity is queried independently.
</p>
</div>
</div>
<div id="outline-container-org1c4cdef" class="outline-3">
<h3 id="org1c4cdef">Q35. What is the document size limit in MongoDB?</h3>
<div class="outline-text-3" id="text-org1c4cdef">
<p>
16 MB per BSON document. Larger binary content should use GridFS or external
object storage; this limit discourages unbounded array growth.
</p>
</div>
</div>
<div id="outline-container-org973f7fe" class="outline-3">
<h3 id="org973f7fe">Q36. How do you model one-to-many in a document store?</h3>
<div class="outline-text-3" id="text-org973f7fe">
<ul class="org-ul">
<li>Few children: embed an array in the parent.</li>
<li>Many children: reference parent id from each child document.</li>
<li>Huge/unbounded: separate collection with parent reference + pagination.</li>
</ul>
</div>
</div>
<div id="outline-container-org4ff0613" class="outline-3">
<h3 id="org4ff0613">Q37. How do you model many-to-many in NoSQL?</h3>
<div class="outline-text-3" id="text-org4ff0613">
<p>
Either embed arrays of references on both sides, maintain a separate "join"
collection/table, or duplicate data per access pattern. The right choice depends
on which side you query and update most.
</p>
</div>
</div>
<div id="outline-container-org3402a36" class="outline-3">
<h3 id="org3402a36">Q38. What is the "outlier pattern"?</h3>
<div class="outline-text-3" id="text-org3402a36">
<p>
A modeling technique where most documents follow one shape but rare large ones
("outliers") are handled differently (e.g., overflow into linked documents) to
avoid degrading the common case.
</p>
</div>
</div>
<div id="outline-container-org80087f2" class="outline-3">
<h3 id="org80087f2">Q39. What is the "bucket pattern"?</h3>
<div class="outline-text-3" id="text-org80087f2">
<p>
Grouping many small time-series/event records into a single document/row "bucket"
(e.g., per hour) to reduce document count and index overhead. Common for IoT and metrics.
</p>
</div>
</div>
<div id="outline-container-orgb36f767" class="outline-3">
<h3 id="orgb36f767">Q40. What is the "subset pattern"?</h3>
<div class="outline-text-3" id="text-orgb36f767">
<p>
Storing a frequently-accessed subset of a large array in the main document (e.g.,
last 10 reviews) and the full set elsewhere, to keep hot documents small and fast.
</p>
</div>
</div>
<div id="outline-container-org9758d93" class="outline-3">
<h3 id="org9758d93">Q41. What is the "computed pattern"?</h3>
<div class="outline-text-3" id="text-org9758d93">
<p>
Pre-calculating and storing derived values (sums, averages, counts) on write
rather than computing them on every read — trading write cost for fast reads.
</p>
</div>
</div>
<div id="outline-container-org39fcb9f" class="outline-3">
<h3 id="org39fcb9f">Q42. What is the "extended reference pattern"?</h3>
<div class="outline-text-3" id="text-org39fcb9f">
<p>
Duplicating a few frequently-needed fields from a referenced document into the
referencing one (e.g., storing customer name in an order) to avoid an extra lookup.
</p>
</div>
</div>
<div id="outline-container-orgb67770c" class="outline-3">
<h3 id="orgb67770c">Q43. What is the "schema versioning pattern"?</h3>
<div class="outline-text-3" id="text-orgb67770c">
<p>
Adding a <code>schema_version</code> field to documents so the application can handle
multiple shapes during gradual migrations without downtime.
</p>
</div>
</div>
<div id="outline-container-orgdcc5868" class="outline-3">
<h3 id="orgdcc5868">Q44. How do you handle schema migration in a schemaless DB?</h3>
<div class="outline-text-3" id="text-orgdcc5868">
<p>
Strategies: lazy migration (transform on read/write), background batch migration,
or dual-write during transition. Use a version field and keep app code tolerant
of multiple versions.
</p>
</div>
</div>
<div id="outline-container-orgb846e6c" class="outline-3">
<h3 id="orgb846e6c">Q45. What is a composite/compound key and when is it used?</h3>
<div class="outline-text-3" id="text-orgb846e6c">
<p>
A key made of multiple components (e.g., partition key + sort key). Used in
wide-column and key-value stores to colocate related items and enable range
queries within a partition.
</p>
</div>
</div>
<div id="outline-container-org642ef1a" class="outline-3">
<h3 id="org642ef1a">Q46. How do you choose a good partition key?</h3>
<div class="outline-text-3" id="text-org642ef1a">
<p>
Pick one with high cardinality and even access distribution to spread load
uniformly, while still grouping data that's queried together. Avoid keys that
concentrate traffic.
</p>
</div>
</div>
<div id="outline-container-orga87c3e2" class="outline-3">
<h3 id="orga87c3e2">Q47. What is a "hot partition" / "hot key"?</h3>
<div class="outline-text-3" id="text-orga87c3e2">
<p>
A partition or key receiving disproportionate traffic, creating a bottleneck on
one node. Caused by low-cardinality or skewed keys (e.g., partitioning by a
constant or by "today's date").
</p>
</div>
</div>
<div id="outline-container-orgc8adc49" class="outline-3">
<h3 id="orgc8adc49">Q48. How do you mitigate hot partitions?</h3>
<div class="outline-text-3" id="text-orgc8adc49">
<p>
Add randomness/sharding suffixes to keys (write sharding), choose
higher-cardinality keys, distribute time-based data across buckets, or cache hot reads.
</p>
</div>
</div>
