org/posts/no-sql.org
** Q49. Why is duplication acceptable in NoSQL?
Storage is cheap relative to compute and latency; duplicating data to serve reads
in a single operation avoids expensive joins/lookups. The trade-off is keeping
duplicates in sync on write.

** Q50. How do you keep duplicated data consistent?
Update all copies in application logic, use background reconciliation jobs,
change-data-capture/streams to propagate changes, or accept eventual consistency
where staleness is tolerable.

** Q51. What is single-table design in DynamoDB?
Storing multiple entity types in one table, using generic partition/sort keys and
overloaded attributes so related items colocate and many access patterns are
served by few queries. Powerful but complex.

** Q52. What are the trade-offs of single-table design?
Pros: fewer requests, colocated data, cost efficiency. Cons: steep learning
curve, opaque key design, hard to evolve access patterns, and difficult ad-hoc analytics.

** Q53. How do you model a tree/hierarchy in a graph DB vs document DB?
Graph DB: natural — nodes with parent/child edges, traverse directly. Document
DB: store an array of ancestors, a materialized path string, or parent
references; choose based on read vs write patterns.

** Q54. What is the materialized path pattern?
Storing the full path to a node as a string (e.g., =/root/a/b=) so subtree queries
become prefix matches. Cheap reads, but moves require updating descendants.

** Q55. How do you model time-series data in NoSQL?
Use bucketing (group by time window), a time-based clustering key for range scans
(Cassandra), TTLs for retention, and pre-aggregation (computed pattern) for
dashboards. Dedicated TSDBs (InfluxDB) optimize this further.

* Document Databases (MongoDB-focused)
** Q56. How do you insert a document in MongoDB?
#+begin_src js
db.users.insertOne({ name: "Ada", age: 36, roles: ["admin"] });
db.users.insertMany([{ name: "Alan" }, { name: "Grace" }]);
#+end_src

** Q57. How do you query documents in MongoDB?
#+begin_src js
db.users.find({ age: { $gte: 30 } });
db.users.findOne({ name: "Ada" });
#+end_src

** Q58. What are common query operators in MongoDB?
Comparison: =$eq=, =$ne=, =$gt=, =$gte=, =$lt=, =$lte=, =$in=, =$nin=.
Logical: =$and=, =$or=, =$not=, =$nor=.
Element: =$exists=, =$type=.
Array: =$all=, =$elemMatch=, =$size=.

** Q59. How do you update a document?
#+begin_src js
db.users.updateOne({ name: "Ada" }, { $set: { age: 37 } });
db.users.updateMany({ active: false }, { $set: { archived: true } });
#+end_src

** Q60. What are common update operators?
=$set=, =$unset=, =$inc=, =$mul=, =$rename=, =$min=, =$max=, =$push=, =$pull=, =$addToSet=, =$pop=, =$currentDate=.

** Q61. How do you delete documents?
#+begin_src js
db.users.deleteOne({ name: "Ada" });
db.users.deleteMany({ archived: true });
#+end_src

** Q62. What is an upsert?
An update that inserts the document if no match exists:

#+begin_src js
db.counters.updateOne({ _id: "page" }, { $inc: { views: 1 } }, { upsert: true });
#+end_src

** Q63. How do you query nested/embedded fields?
Use dot notation:

#+begin_src js
db.users.find({ "address.city": "Sofia" });
#+end_src

** Q64. How do you query arrays?
#+begin_src js
db.posts.find({ tags: "mongodb" });                       // array contains value
db.posts.find({ tags: { $all: ["db", "nosql"] } });       // contains all
db.orders.find({ items: { $elemMatch: { qty: { $gt: 5 } } } }); // element match
#+end_src

** Q65. How do you project specific fields?
#+begin_src js
db.users.find({}, { name: 1, email: 1, _id: 0 });
#+end_src

** Q66. What is the aggregation pipeline?
A framework that processes documents through a sequence of stages (=$match=,
=$group=, =$sort=, =$project=, =$lookup=, etc.), each transforming the stream —
analogous to SQL GROUP BY/joins/transforms.

** Q67. Give an aggregation example.
#+begin_src js
db.orders.aggregate([
  { $match: { status: "paid" } },
  { $group: { _id: "$customerId", total: { $sum: "$amount" } } },
  { $sort: { total: -1 } },
  { $limit: 10 }
]);
#+end_src

** Q68. What does the $lookup stage do?
Performs a left outer join to another collection:

#+begin_src js
db.orders.aggregate([
  { $lookup: { from: "customers", localField: "custId",
               foreignField: "_id", as: "customer" } }
]);
#+end_src

** Q69. What is the difference between $match early vs late?
Place =$match= as early as possible so the pipeline filters before expensive
stages and can use indexes — reducing documents flowing downstream.

** Q70. What does $unwind do?
Deconstructs an array field, outputting one document per array element — used
before grouping or joining on array contents.

** Q71. What is the difference between find() and aggregate()?
=find()= retrieves/filters documents with simple projections. =aggregate()=
performs multi-stage transformations, grouping, joins, and computed fields. Use
aggregate for analytics/reshaping.

