public/posts/no-sql.html
<div id="outline-container-org5e066d8" class="outline-3">
<h3 id="org5e066d8">Q49. Why is duplication acceptable in NoSQL?</h3>
<div class="outline-text-3" id="text-org5e066d8">
<p>
Storage is cheap relative to compute and latency; duplicating data to serve reads
in a single operation avoids expensive joins/lookups. The trade-off is keeping
duplicates in sync on write.
</p>
</div>
</div>
<div id="outline-container-orga06e2e5" class="outline-3">
<h3 id="orga06e2e5">Q50. How do you keep duplicated data consistent?</h3>
<div class="outline-text-3" id="text-orga06e2e5">
<p>
Update all copies in application logic, use background reconciliation jobs,
change-data-capture/streams to propagate changes, or accept eventual consistency
where staleness is tolerable.
</p>
</div>
</div>
<div id="outline-container-org169843e" class="outline-3">
<h3 id="org169843e">Q51. What is single-table design in DynamoDB?</h3>
<div class="outline-text-3" id="text-org169843e">
<p>
Storing multiple entity types in one table, using generic partition/sort keys and
overloaded attributes so related items colocate and many access patterns are
served by few queries. Powerful but complex.
</p>
</div>
</div>
<div id="outline-container-org7d649ab" class="outline-3">
<h3 id="org7d649ab">Q52. What are the trade-offs of single-table design?</h3>
<div class="outline-text-3" id="text-org7d649ab">
<p>
Pros: fewer requests, colocated data, cost efficiency. Cons: steep learning
curve, opaque key design, hard to evolve access patterns, and difficult ad-hoc analytics.
</p>
</div>
</div>
<div id="outline-container-org30ff63a" class="outline-3">
<h3 id="org30ff63a">Q53. How do you model a tree/hierarchy in a graph DB vs document DB?</h3>
<div class="outline-text-3" id="text-org30ff63a">
<p>
Graph DB: natural — nodes with parent/child edges, traverse directly. Document
DB: store an array of ancestors, a materialized path string, or parent
references; choose based on read vs write patterns.
</p>
</div>
</div>
<div id="outline-container-org5efedde" class="outline-3">
<h3 id="org5efedde">Q54. What is the materialized path pattern?</h3>
<div class="outline-text-3" id="text-org5efedde">
<p>
Storing the full path to a node as a string (e.g., <code>/root/a/b</code>) so subtree queries
become prefix matches. Cheap reads, but moves require updating descendants.
</p>
</div>
</div>
<div id="outline-container-orgd4481e0" class="outline-3">
<h3 id="orgd4481e0">Q55. How do you model time-series data in NoSQL?</h3>
<div class="outline-text-3" id="text-orgd4481e0">
<p>
Use bucketing (group by time window), a time-based clustering key for range scans
(Cassandra), TTLs for retention, and pre-aggregation (computed pattern) for
dashboards. Dedicated TSDBs (InfluxDB) optimize this further.
</p>
</div>
</div>
</div>
<div id="outline-container-org9b8b03b" class="outline-2">
<h2 id="org9b8b03b">Document Databases (MongoDB-focused)</h2>
<div class="outline-text-2" id="text-org9b8b03b">
</div>
<div id="outline-container-org6e77ee3" class="outline-3">
<h3 id="org6e77ee3">Q56. How do you insert a document in MongoDB?</h3>
<div class="outline-text-3" id="text-org6e77ee3">
<div class="org-src-container">
<pre class="src src-js">db.users.insertOne({ name: <span style="font-style: italic;">"Ada"</span>, age: 36, roles: [<span style="font-style: italic;">"admin"</span>] });
db.users.insertMany([{ name: <span style="font-style: italic;">"Alan"</span> }, { name: <span style="font-style: italic;">"Grace"</span> }]);
</pre>
</div>
</div>
</div>
<div id="outline-container-org04cc6c7" class="outline-3">
<h3 id="org04cc6c7">Q57. How do you query documents in MongoDB?</h3>
<div class="outline-text-3" id="text-org04cc6c7">
<div class="org-src-container">
<pre class="src src-js">db.users.find({ age: { $gte: 30 } });
db.users.findOne({ name: <span style="font-style: italic;">"Ada"</span> });
</pre>
</div>
</div>
</div>
<div id="outline-container-org41653fe" class="outline-3">
<h3 id="org41653fe">Q58. What are common query operators in MongoDB?</h3>
<div class="outline-text-3" id="text-org41653fe">
<p>
Comparison: <code>$eq</code>, <code>$ne</code>, <code>$gt</code>, <code>$gte</code>, <code>$lt</code>, <code>$lte</code>, <code>$in</code>, <code>$nin</code>.
Logical: <code>$and</code>, <code>$or</code>, <code>$not</code>, <code>$nor</code>.
Element: <code>$exists</code>, <code>$type</code>.
Array: <code>$all</code>, <code>$elemMatch</code>, <code>$size</code>.
</p>
</div>
</div>
<div id="outline-container-org79dc7b3" class="outline-3">
<h3 id="org79dc7b3">Q59. How do you update a document?</h3>
<div class="outline-text-3" id="text-org79dc7b3">
<div class="org-src-container">
<pre class="src src-js">db.users.updateOne({ name: <span style="font-style: italic;">"Ada"</span> }, { $set: { age: 37 } });
db.users.updateMany({ active: <span style="font-weight: bold; text-decoration: underline;">false</span> }, { $set: { archived: <span style="font-weight: bold; text-decoration: underline;">true</span> } });
</pre>
</div>
</div>
</div>
<div id="outline-container-org282ab2f" class="outline-3">
<h3 id="org282ab2f">Q60. What are common update operators?</h3>
<div class="outline-text-3" id="text-org282ab2f">
<p>
<code>$set</code>, <code>$unset</code>, <code>$inc</code>, <code>$mul</code>, <code>$rename</code>, <code>$min</code>, <code>$max</code>, <code>$push</code>, <code>$pull</code>, <code>$addToSet</code>, <code>$pop</code>, <code>$currentDate</code>.
</p>
</div>
</div>
<div id="outline-container-org5f74058" class="outline-3">
<h3 id="org5f74058">Q61. How do you delete documents?</h3>
<div class="outline-text-3" id="text-org5f74058">
<div class="org-src-container">
<pre class="src src-js">db.users.deleteOne({ name: <span style="font-style: italic;">"Ada"</span> });
db.users.deleteMany({ archived: <span style="font-weight: bold; text-decoration: underline;">true</span> });
</pre>
</div>
</div>
</div>
<div id="outline-container-orgaa58343" class="outline-3">
<h3 id="orgaa58343">Q62. What is an upsert?</h3>
<div class="outline-text-3" id="text-orgaa58343">
<p>
An update that inserts the document if no match exists:
</p>

<div class="org-src-container">
<pre class="src src-js">db.counters.updateOne({ _id: <span style="font-style: italic;">"page"</span> }, { $inc: { views: 1 } }, { upsert: <span style="font-weight: bold; text-decoration: underline;">true</span> });
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf90f7d1" class="outline-3">
<h3 id="orgf90f7d1">Q63. How do you query nested/embedded fields?</h3>
<div class="outline-text-3" id="text-orgf90f7d1">
<p>
Use dot notation:
</p>

<div class="org-src-container">
<pre class="src src-js">db.users.find({ <span style="font-style: italic;">"address.city"</span>: <span style="font-style: italic;">"Sofia"</span> });
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdb25428" class="outline-3">
<h3 id="orgdb25428">Q64. How do you query arrays?</h3>
<div class="outline-text-3" id="text-orgdb25428">
<div class="org-src-container">
<pre class="src src-js">db.posts.find({ tags: <span style="font-style: italic;">"mongodb"</span> });                       <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">array contains value
</span>db.posts.find({ tags: { $all: [<span style="font-style: italic;">"db"</span>, <span style="font-style: italic;">"nosql"</span>] } });       <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">contains all
</span>db.orders.find({ items: { $elemMatch: { qty: { $gt: 5 } } } }); <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">element match</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org57ce4bc" class="outline-3">
<h3 id="org57ce4bc">Q65. How do you project specific fields?</h3>
<div class="outline-text-3" id="text-org57ce4bc">
<div class="org-src-container">
<pre class="src src-js">db.users.find({}, { name: 1, email: 1, _id: 0 });
</pre>
</div>
</div>
</div>
<div id="outline-container-org5d9aa2c" class="outline-3">
<h3 id="org5d9aa2c">Q66. What is the aggregation pipeline?</h3>
<div class="outline-text-3" id="text-org5d9aa2c">
<p>
A framework that processes documents through a sequence of stages (<code>$match</code>,
<code>$group</code>, <code>$sort</code>, <code>$project</code>, <code>$lookup</code>, etc.), each transforming the stream —
analogous to SQL GROUP BY/joins/transforms.
</p>
</div>
</div>
<div id="outline-container-orgb4a14e3" class="outline-3">
<h3 id="orgb4a14e3">Q67. Give an aggregation example.</h3>
<div class="outline-text-3" id="text-orgb4a14e3">
<div class="org-src-container">
<pre class="src src-js">db.orders.aggregate([
  { $match: { status: <span style="font-style: italic;">"paid"</span> } },
  { $group: { _id: <span style="font-style: italic;">"$customerId"</span>, total: { $sum: <span style="font-style: italic;">"$amount"</span> } } },
  { $sort: { total: -1 } },
  { $limit: 10 }
]);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc2568fe" class="outline-3">
<h3 id="orgc2568fe">Q68. What does the $lookup stage do?</h3>
<div class="outline-text-3" id="text-orgc2568fe">
<p>
Performs a left outer join to another collection:
</p>

<div class="org-src-container">
<pre class="src src-js">db.orders.aggregate([
  { $lookup: { from: <span style="font-style: italic;">"customers"</span>, localField: <span style="font-style: italic;">"custId"</span>,
               foreignField: <span style="font-style: italic;">"_id"</span>, as: <span style="font-style: italic;">"customer"</span> } }
]);
</pre>
</div>
</div>
</div>
<div id="outline-container-org8d4d1e8" class="outline-3">
<h3 id="org8d4d1e8">Q69. What is the difference between $match early vs late?</h3>
<div class="outline-text-3" id="text-org8d4d1e8">
<p>
Place <code>$match</code> as early as possible so the pipeline filters before expensive
stages and can use indexes — reducing documents flowing downstream.
</p>
</div>
</div>
<div id="outline-container-org0da7ce8" class="outline-3">
<h3 id="org0da7ce8">Q70. What does $unwind do?</h3>
<div class="outline-text-3" id="text-org0da7ce8">
<p>
Deconstructs an array field, outputting one document per array element — used
before grouping or joining on array contents.
</p>
</div>
</div>
<div id="outline-container-org84ab102" class="outline-3">
<h3 id="org84ab102">Q71. What is the difference between find() and aggregate()?</h3>
<div class="outline-text-3" id="text-org84ab102">
<p>
<code>find()</code> retrieves/filters documents with simple projections. <code>aggregate()</code>
performs multi-stage transformations, grouping, joins, and computed fields. Use
aggregate for analytics/reshaping.
</p>
</div>
</div>
