org/posts/no-sql.org
** Q72. How do you create an index in MongoDB?
#+begin_src js
db.users.createIndex({ email: 1 }, { unique: true });
db.posts.createIndex({ author: 1, createdAt: -1 });  // compound
#+end_src

** Q73. What is a compound index, and does field order matter?
An index on multiple fields. Order matters via the prefix rule: an index on
={a:1, b:1}= serves queries on =a= or =a+b=, but not =b= alone. Order also affects
sort support.

** Q74. What is a covered query?
A query answered entirely from an index without reading documents (all queried
and returned fields are in the index). Very fast — no document fetch.

** Q75. How do you analyze query performance in MongoDB?
Use =explain("executionStats")=:

#+begin_src js
db.users.find({ email: a@b.com }).explain("executionStats");
#+end_src

Look for =IXSCAN= (index) vs =COLLSCAN= (full scan) and docs examined vs returned.

** Q76. What are multikey indexes?
Indexes on array fields — MongoDB creates an index entry per array element,
enabling queries on array contents. A document can be in many index entries.

** Q77. What is a TTL index?
An index that auto-deletes documents after a time based on a date field:

#+begin_src js
db.sessions.createIndex({ createdAt: 1 }, { expireAfterSeconds: 3600 });
#+end_src

** Q78. What is a text index, and how is full-text search done?
A text index tokenizes string fields for search:

#+begin_src js
db.articles.createIndex({ body: "text" });
db.articles.find({ $text: { $search: "nosql database" } });
#+end_src

For richer search, use Elasticsearch or Atlas Search.

** Q79. What is a partial / sparse index?
A *sparse* index only indexes documents that contain the field. A *partial* index
indexes documents matching a filter expression — smaller indexes for targeted queries.

** Q80. How does MongoDB handle transactions?
Single-document writes are always atomic. Since 4.0 (replica sets) / 4.2
(sharded), multi-document ACID transactions are supported via sessions, but they
add overhead — prefer single-document atomicity where possible.

** Q81. What are read and write concerns in MongoDB?
*Write concern* (=w=, =j=) controls how many nodes must acknowledge a write and
whether it's journaled. *Read concern* (=local=, =majority=, =linearizable=)
controls the consistency/recency of data read.

** Q82. What is read preference?
A setting that routes reads to =primary=, =secondary=, =primaryPreferred=, etc.,
trading consistency for read scaling/locality. Reading from secondaries can return stale data.

** Q83. What is the WiredTiger storage engine?
MongoDB's default storage engine providing document-level concurrency control,
compression, and MVCC-based snapshots for consistent reads.

** Q84. What is GridFS?
A MongoDB convention for storing files larger than 16 MB by splitting them into
chunks across two collections (=fs.files=, =fs.chunks=).

** Q85. How does MongoDB sharding work?
Data is partitioned across shards by a shard key. =mongos= routers direct queries;
config servers store metadata. The balancer migrates chunks to keep distribution even.

** Q86. What is a change stream?
A real-time feed of data changes (inserts/updates/deletes) on a collection or
database, built on the oplog — used for event-driven architectures and cache invalidation.

* Key-Value & Caching (Redis-focused)
** Q87. What is Redis?
An in-memory key-value data store supporting rich data structures, used as a
cache, message broker, session store, and primary database (with persistence).
Extremely low latency.

** Q88. What data structures does Redis support?
Strings, Lists, Sets, Sorted Sets (ZSet), Hashes, Bitmaps, HyperLogLog, Streams,
Geospatial indexes, and (with modules) JSON, search, time-series, bloom filters.

** Q89. What are basic Redis string commands?
#+begin_src text
SET key value
GET key
INCR counter
SETEX key 60 value      # expire in 60s
MSET k1 v1 k2 v2
#+end_src

** Q90. How does Redis handle expiration/TTL?
=EXPIRE key seconds= or =SET key val EX seconds=. Keys are removed lazily (on
access) and via periodic active sampling. =TTL key= returns remaining time.

** Q91. What are Redis eviction policies?
When memory is full, Redis evicts per =maxmemory-policy=: =noeviction=, =allkeys-lru=,
=allkeys-lfu=, =volatile-lru=, =volatile-lfu=, =volatile-ttl=, =allkeys-random=, =volatile-random=.

** Q92. What is the difference between LRU and LFU eviction?
*LRU* evicts least-recently-used keys (time-based). *LFU* evicts
least-frequently-used keys (access-count-based) — better when some keys are
consistently hot regardless of recency.

** Q93. How does Redis persist data?
*RDB* takes point-in-time snapshots (compact, faster restart, possible data loss).
*AOF* logs every write (more durable, larger, slower). They can be combined.

** Q94. What is a Redis Sorted Set and a use case?
A set of unique members each with a score, kept ordered by score. Use cases:
leaderboards, priority queues, rate limiting, time-ordered feeds.

#+begin_src text
ZADD leaderboard 100 "ada"
ZREVRANGE leaderboard 0 9 WITHSCORES
#+end_src

** Q95. What is Redis Pub/Sub?
A messaging pattern where publishers send messages to channels and subscribers
receive them in real time. Fire-and-forget (no persistence); use Streams for
durable messaging.

** Q96. What are Redis Streams?
An append-only log data structure for durable, ordered messaging with consumer
groups, IDs, and acknowledgments — like a lightweight Kafka inside Redis.

