public/posts/no-sql.html
<div id="outline-container-org65e0004" class="outline-3">
<h3 id="org65e0004">Q72. How do you create an index in MongoDB?</h3>
<div class="outline-text-3" id="text-org65e0004">
<div class="org-src-container">
<pre class="src src-js">db.users.createIndex({ email: 1 }, { unique: <span style="font-weight: bold; text-decoration: underline;">true</span> });
db.posts.createIndex({ author: 1, createdAt: -1 });  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">compound</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1facb74" class="outline-3">
<h3 id="org1facb74">Q73. What is a compound index, and does field order matter?</h3>
<div class="outline-text-3" id="text-org1facb74">
<p>
An index on multiple fields. Order matters via the prefix rule: an index on
<code>{a:1, b:1}</code> serves queries on <code>a</code> or <code>a+b</code>, but not <code>b</code> alone. Order also affects
sort support.
</p>
</div>
</div>
<div id="outline-container-org066d312" class="outline-3">
<h3 id="org066d312">Q74. What is a covered query?</h3>
<div class="outline-text-3" id="text-org066d312">
<p>
A query answered entirely from an index without reading documents (all queried
and returned fields are in the index). Very fast — no document fetch.
</p>
</div>
</div>
<div id="outline-container-org904b5a8" class="outline-3">
<h3 id="org904b5a8">Q75. How do you analyze query performance in MongoDB?</h3>
<div class="outline-text-3" id="text-org904b5a8">
<p>
Use <code>explain("executionStats")</code>:
</p>

<div class="org-src-container">
<pre class="src src-js">db.users.find({ email: a@b.com }).explain(<span style="font-style: italic;">"executionStats"</span>);
</pre>
</div>

<p>
Look for <code>IXSCAN</code> (index) vs <code>COLLSCAN</code> (full scan) and docs examined vs returned.
</p>
</div>
</div>
<div id="outline-container-orgdb08500" class="outline-3">
<h3 id="orgdb08500">Q76. What are multikey indexes?</h3>
<div class="outline-text-3" id="text-orgdb08500">
<p>
Indexes on array fields — MongoDB creates an index entry per array element,
enabling queries on array contents. A document can be in many index entries.
</p>
</div>
</div>
<div id="outline-container-org87be1f6" class="outline-3">
<h3 id="org87be1f6">Q77. What is a TTL index?</h3>
<div class="outline-text-3" id="text-org87be1f6">
<p>
An index that auto-deletes documents after a time based on a date field:
</p>

<div class="org-src-container">
<pre class="src src-js">db.sessions.createIndex({ createdAt: 1 }, { expireAfterSeconds: 3600 });
</pre>
</div>
</div>
</div>
<div id="outline-container-org3271991" class="outline-3">
<h3 id="org3271991">Q78. What is a text index, and how is full-text search done?</h3>
<div class="outline-text-3" id="text-org3271991">
<p>
A text index tokenizes string fields for search:
</p>

<div class="org-src-container">
<pre class="src src-js">db.articles.createIndex({ body: <span style="font-style: italic;">"text"</span> });
db.articles.find({ $text: { $search: <span style="font-style: italic;">"nosql database"</span> } });
</pre>
</div>

<p>
For richer search, use Elasticsearch or Atlas Search.
</p>
</div>
</div>
<div id="outline-container-orgf19665d" class="outline-3">
<h3 id="orgf19665d">Q79. What is a partial / sparse index?</h3>
<div class="outline-text-3" id="text-orgf19665d">
<p>
A <b>sparse</b> index only indexes documents that contain the field. A <b>partial</b> index
indexes documents matching a filter expression — smaller indexes for targeted queries.
</p>
</div>
</div>
<div id="outline-container-org37b39d9" class="outline-3">
<h3 id="org37b39d9">Q80. How does MongoDB handle transactions?</h3>
<div class="outline-text-3" id="text-org37b39d9">
<p>
Single-document writes are always atomic. Since 4.0 (replica sets) / 4.2
(sharded), multi-document ACID transactions are supported via sessions, but they
add overhead — prefer single-document atomicity where possible.
</p>
</div>
</div>
<div id="outline-container-org7ba37ae" class="outline-3">
<h3 id="org7ba37ae">Q81. What are read and write concerns in MongoDB?</h3>
<div class="outline-text-3" id="text-org7ba37ae">
<p>
<b>Write concern</b> (<code>w</code>, <code>j</code>) controls how many nodes must acknowledge a write and
whether it's journaled. <b>Read concern</b> (<code>local</code>, <code>majority</code>, <code>linearizable</code>)
controls the consistency/recency of data read.
</p>
</div>
</div>
<div id="outline-container-orgec6f649" class="outline-3">
<h3 id="orgec6f649">Q82. What is read preference?</h3>
<div class="outline-text-3" id="text-orgec6f649">
<p>
A setting that routes reads to <code>primary</code>, <code>secondary</code>, <code>primaryPreferred</code>, etc.,
trading consistency for read scaling/locality. Reading from secondaries can return stale data.
</p>
</div>
</div>
<div id="outline-container-org230f512" class="outline-3">
<h3 id="org230f512">Q83. What is the WiredTiger storage engine?</h3>
<div class="outline-text-3" id="text-org230f512">
<p>
MongoDB's default storage engine providing document-level concurrency control,
compression, and MVCC-based snapshots for consistent reads.
</p>
</div>
</div>
<div id="outline-container-org5c12b22" class="outline-3">
<h3 id="org5c12b22">Q84. What is GridFS?</h3>
<div class="outline-text-3" id="text-org5c12b22">
<p>
A MongoDB convention for storing files larger than 16 MB by splitting them into
chunks across two collections (<code>fs.files</code>, <code>fs.chunks</code>).
</p>
</div>
</div>
<div id="outline-container-org8470a57" class="outline-3">
<h3 id="org8470a57">Q85. How does MongoDB sharding work?</h3>
<div class="outline-text-3" id="text-org8470a57">
<p>
Data is partitioned across shards by a shard key. <code>mongos</code> routers direct queries;
config servers store metadata. The balancer migrates chunks to keep distribution even.
</p>
</div>
</div>
<div id="outline-container-org5934168" class="outline-3">
<h3 id="org5934168">Q86. What is a change stream?</h3>
<div class="outline-text-3" id="text-org5934168">
<p>
A real-time feed of data changes (inserts/updates/deletes) on a collection or
database, built on the oplog — used for event-driven architectures and cache invalidation.
</p>
</div>
</div>
</div>
<div id="outline-container-org7cde2ca" class="outline-2">
<h2 id="org7cde2ca">Key-Value &amp; Caching (Redis-focused)</h2>
<div class="outline-text-2" id="text-org7cde2ca">
</div>
<div id="outline-container-org38a37c0" class="outline-3">
<h3 id="org38a37c0">Q87. What is Redis?</h3>
<div class="outline-text-3" id="text-org38a37c0">
<p>
An in-memory key-value data store supporting rich data structures, used as a
cache, message broker, session store, and primary database (with persistence).
Extremely low latency.
</p>
</div>
</div>
<div id="outline-container-org5cc7da0" class="outline-3">
<h3 id="org5cc7da0">Q88. What data structures does Redis support?</h3>
<div class="outline-text-3" id="text-org5cc7da0">
<p>
Strings, Lists, Sets, Sorted Sets (ZSet), Hashes, Bitmaps, HyperLogLog, Streams,
Geospatial indexes, and (with modules) JSON, search, time-series, bloom filters.
</p>
</div>
</div>
<div id="outline-container-org15fb202" class="outline-3">
<h3 id="org15fb202">Q89. What are basic Redis string commands?</h3>
<div class="outline-text-3" id="text-org15fb202">
<div class="org-src-container">
<pre class="src src-text">SET key value
GET key
INCR counter
SETEX key 60 value      # expire in 60s
MSET k1 v1 k2 v2
</pre>
</div>
</div>
</div>
<div id="outline-container-org7f14674" class="outline-3">
<h3 id="org7f14674">Q90. How does Redis handle expiration/TTL?</h3>
<div class="outline-text-3" id="text-org7f14674">
<p>
<code>EXPIRE key seconds</code> or <code>SET key val EX seconds</code>. Keys are removed lazily (on
access) and via periodic active sampling. <code>TTL key</code> returns remaining time.
</p>
</div>
</div>
<div id="outline-container-org40fc645" class="outline-3">
<h3 id="org40fc645">Q91. What are Redis eviction policies?</h3>
<div class="outline-text-3" id="text-org40fc645">
<p>
When memory is full, Redis evicts per <code>maxmemory-policy</code>: <code>noeviction</code>, <code>allkeys-lru</code>,
<code>allkeys-lfu</code>, <code>volatile-lru</code>, <code>volatile-lfu</code>, <code>volatile-ttl</code>, <code>allkeys-random</code>, <code>volatile-random</code>.
</p>
</div>
</div>
<div id="outline-container-orgd7bef63" class="outline-3">
<h3 id="orgd7bef63">Q92. What is the difference between LRU and LFU eviction?</h3>
<div class="outline-text-3" id="text-orgd7bef63">
<p>
<b>LRU</b> evicts least-recently-used keys (time-based). <b>LFU</b> evicts
least-frequently-used keys (access-count-based) — better when some keys are
consistently hot regardless of recency.
</p>
</div>
</div>
<div id="outline-container-orga2f0edf" class="outline-3">
<h3 id="orga2f0edf">Q93. How does Redis persist data?</h3>
<div class="outline-text-3" id="text-orga2f0edf">
<p>
<b>RDB</b> takes point-in-time snapshots (compact, faster restart, possible data loss).
<b>AOF</b> logs every write (more durable, larger, slower). They can be combined.
</p>
</div>
</div>
<div id="outline-container-orgad988d4" class="outline-3">
<h3 id="orgad988d4">Q94. What is a Redis Sorted Set and a use case?</h3>
<div class="outline-text-3" id="text-orgad988d4">
<p>
A set of unique members each with a score, kept ordered by score. Use cases:
leaderboards, priority queues, rate limiting, time-ordered feeds.
</p>

<div class="org-src-container">
<pre class="src src-text">ZADD leaderboard 100 "ada"
ZREVRANGE leaderboard 0 9 WITHSCORES
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcaa62f6" class="outline-3">
<h3 id="orgcaa62f6">Q95. What is Redis Pub/Sub?</h3>
<div class="outline-text-3" id="text-orgcaa62f6">
<p>
A messaging pattern where publishers send messages to channels and subscribers
receive them in real time. Fire-and-forget (no persistence); use Streams for
durable messaging.
</p>
</div>
</div>
<div id="outline-container-org07099fa" class="outline-3">
<h3 id="org07099fa">Q96. What are Redis Streams?</h3>
<div class="outline-text-3" id="text-org07099fa">
<p>
An append-only log data structure for durable, ordered messaging with consumer
groups, IDs, and acknowledgments — like a lightweight Kafka inside Redis.
</p>
</div>
</div>
