public/posts/no-sql.html
<div id="outline-container-orga56ba1e" class="outline-3">
<h3 id="orga56ba1e">Q97. How do you implement caching patterns with Redis?</h3>
<div class="outline-text-3" id="text-orga56ba1e">
<p>
<b>Cache-aside</b> (lazy): app checks cache, on miss loads from DB and populates.
<b>Write-through</b>: write to cache and DB together. <b>Write-behind</b>: write to cache,
async flush to DB. <b>Read-through</b>: cache library loads on miss.
</p>
</div>
</div>
<div id="outline-container-org1e9d90f" class="outline-3">
<h3 id="org1e9d90f">Q98. What is the thundering herd / cache stampede problem?</h3>
<div class="outline-text-3" id="text-org1e9d90f">
<p>
When a popular key expires, many requests simultaneously miss and hit the DB.
Mitigations: locking/single-flight, staggered TTLs, probabilistic early
expiration, or background refresh.
</p>
</div>
</div>
<div id="outline-container-orgb6f66cb" class="outline-3">
<h3 id="orgb6f66cb">Q99. How do you implement a distributed lock with Redis?</h3>
<div class="outline-text-3" id="text-orgb6f66cb">
<p>
<code>SET key token NX PX 30000</code> acquires a lock atomically with expiry; release by
checking the token and deleting (via Lua for atomicity). The Redlock algorithm
extends this across multiple nodes.
</p>
</div>
</div>
<div id="outline-container-org36094d7" class="outline-3">
<h3 id="org36094d7">Q100. What is Redis Cluster?</h3>
<div class="outline-text-3" id="text-org36094d7">
<p>
Redis's native sharding: data is split across 16384 hash slots distributed over
master nodes, each with replicas. Clients are redirected to the node owning a key's slot.
</p>
</div>
</div>
<div id="outline-container-org90bd86f" class="outline-3">
<h3 id="org90bd86f">Q101. Is Redis single-threaded?</h3>
<div class="outline-text-3" id="text-org90bd86f">
<p>
The core command execution is single-threaded (avoiding locks), which is why
atomic operations are simple. Modern Redis uses threads for I/O and background
tasks, but command processing is effectively serialized.
</p>
</div>
</div>
<div id="outline-container-org76cdd6f" class="outline-3">
<h3 id="org76cdd6f">Q102. What is DynamoDB?</h3>
<div class="outline-text-3" id="text-org76cdd6f">
<p>
AWS's fully managed key-value/document NoSQL service offering single-digit
millisecond latency, automatic scaling, and a serverless operational model with
tunable capacity.
</p>
</div>
</div>
<div id="outline-container-org563f45f" class="outline-3">
<h3 id="org563f45f">Q103. What are partition key and sort key in DynamoDB?</h3>
<div class="outline-text-3" id="text-org563f45f">
<p>
The <b>partition key</b> (hash key) determines item placement; alone it must be unique.
With a <b>sort key</b>, the pair must be unique and items sharing a partition key are
stored sorted, enabling range queries.
</p>
</div>
</div>
<div id="outline-container-org1cf8338" class="outline-3">
<h3 id="org1cf8338">Q104. What is the difference between Query and Scan in DynamoDB?</h3>
<div class="outline-text-3" id="text-org1cf8338">
<p>
<b>Query</b> efficiently retrieves items by partition key (and optional sort-key
condition) using indexes. <b>Scan</b> reads the entire table and filters — slow and
costly; avoid in production paths.
</p>
</div>
</div>
<div id="outline-container-org29fc582" class="outline-3">
<h3 id="org29fc582">Q105. What are GSIs and LSIs in DynamoDB?</h3>
<div class="outline-text-3" id="text-org29fc582">
<p>
<b>Global Secondary Index</b>: different partition/sort key, separate throughput,
eventually consistent. <b>Local Secondary Index</b>: same partition key, alternate
sort key, supports strong consistency, must be created at table creation.
</p>
</div>
</div>
<div id="outline-container-org061c716" class="outline-3">
<h3 id="org061c716">Q106. What consistency options does DynamoDB offer?</h3>
<div class="outline-text-3" id="text-org061c716">
<p>
Reads can be <b>eventually consistent</b> (default, cheaper) or <b>strongly consistent</b>
(on demand, costs more, not available on GSIs). Writes are always durable across AZs.
</p>
</div>
</div>
</div>
<div id="outline-container-org4f040bf" class="outline-2">
<h2 id="org4f040bf">Wide-Column Stores (Cassandra-focused)</h2>
<div class="outline-text-2" id="text-org4f040bf">
</div>
<div id="outline-container-orgb9ac52b" class="outline-3">
<h3 id="orgb9ac52b">Q107. What is Apache Cassandra?</h3>
<div class="outline-text-3" id="text-orgb9ac52b">
<p>
A distributed, masterless (peer-to-peer) wide-column NoSQL database designed for
high availability, linear horizontal scalability, and high write throughput with
no single point of failure.
</p>
</div>
</div>
<div id="outline-container-orgbfdeedb" class="outline-3">
<h3 id="orgbfdeedb">Q108. What is the data model in Cassandra?</h3>
<div class="outline-text-3" id="text-orgbfdeedb">
<p>
A keyspace contains tables; each table has a primary key composed of a partition
key (placement) and optional clustering columns (ordering within a partition).
Rows are sparse — columns can vary.
</p>
</div>
</div>
<div id="outline-container-orgaa2ac4d" class="outline-3">
<h3 id="orgaa2ac4d">Q109. What is CQL?</h3>
<div class="outline-text-3" id="text-orgaa2ac4d">
<p>
Cassandra Query Language — a SQL-like language for Cassandra. It looks relational
but disallows arbitrary joins/aggregations and requires queries aligned to the
partition key.
</p>
</div>
</div>
<div id="outline-container-org74d27cd" class="outline-3">
<h3 id="org74d27cd">Q110. Why must you "model around your queries" in Cassandra?</h3>
<div class="outline-text-3" id="text-org74d27cd">
<p>
Cassandra only retrieves data efficiently by partition key. You design one table
per query pattern (often duplicating data) because there are no efficient joins or
ad-hoc filters across partitions.
</p>
</div>
</div>
<div id="outline-container-org6e69e03" class="outline-3">
<h3 id="org6e69e03">Q111. How does Cassandra distribute data?</h3>
<div class="outline-text-3" id="text-org6e69e03">
<p>
By consistent hashing of the partition key onto a token ring. Each node owns
token ranges; virtual nodes (vnodes) improve balance and rebalancing.
</p>
</div>
</div>
<div id="outline-container-org1ca45f0" class="outline-3">
<h3 id="org1ca45f0">Q112. What is the replication factor?</h3>
<div class="outline-text-3" id="text-org1ca45f0">
<p>
The number of copies of each partition stored across the cluster (e.g., RF=3).
Configured per keyspace; higher RF improves availability/durability at storage cost.
</p>
</div>
</div>
<div id="outline-container-orgdcfc838" class="outline-3">
<h3 id="orgdcfc838">Q113. What is tunable consistency in Cassandra?</h3>
<div class="outline-text-3" id="text-orgdcfc838">
<p>
Per-query consistency levels (<code>ONE</code>, <code>QUORUM</code>, <code>LOCAL_QUORUM</code>, <code>ALL</code>, etc.).
If read CL + write CL &gt; RF, you get strong consistency;
lower levels trade consistency for latency/availability.
</p>
</div>
</div>
<div id="outline-container-org827cc28" class="outline-3">
<h3 id="org827cc28">Q114. What does QUORUM mean?</h3>
<div class="outline-text-3" id="text-org827cc28">
<p>
A majority of replicas: <code>floor(RF/2) + 1</code>. <code>QUORUM</code> reads/writes across all DCs;
<code>LOCAL_QUORUM</code> within the local datacenter (lower latency, common in multi-DC deployments).
</p>
</div>
</div>
<div id="outline-container-orgf1e5bed" class="outline-3">
<h3 id="orgf1e5bed">Q115. What is a write path in Cassandra?</h3>
<div class="outline-text-3" id="text-orgf1e5bed">
<p>
A write goes to the commit log (durability) and a memtable (in-memory). Memtables
flush to immutable SSTables on disk. No read-before-write, enabling fast writes.
</p>
</div>
</div>
<div id="outline-container-org4701c51" class="outline-3">
<h3 id="org4701c51">Q116. What is compaction?</h3>
<div class="outline-text-3" id="text-org4701c51">
<p>
The background process that merges SSTables, discarding obsolete/tombstoned data
to reclaim space and improve read performance. Strategies: STCS, LCS, TWCS
(time-window, for time-series).
</p>
</div>
</div>
<div id="outline-container-orgf5e9603" class="outline-3">
<h3 id="orgf5e9603">Q117. What is a tombstone?</h3>
<div class="outline-text-3" id="text-orgf5e9603">
<p>
A marker for deleted data. Cassandra doesn't delete in place; it writes a
tombstone, and data is purged during compaction after <code>gc_grace_seconds</code>. Too
many tombstones degrade reads.
</p>
</div>
</div>
<div id="outline-container-org719150b" class="outline-3">
<h3 id="org719150b">Q118. Why are deletes problematic in Cassandra?</h3>
<div class="outline-text-3" id="text-org719150b">
<p>
Deletes create tombstones that linger until compaction. Heavy delete/update
churn (especially queue-like patterns) causes tombstone buildup, slowing range
reads and risking query failures.
</p>
</div>
</div>
<div id="outline-container-org9a3f3d9" class="outline-3">
<h3 id="org9a3f3d9">Q119. What is read repair?</h3>
<div class="outline-text-3" id="text-org9a3f3d9">
<p>
A mechanism that detects and fixes inconsistencies among replicas during reads by
comparing data and pushing the latest version to stale replicas.
</p>
</div>
</div>
<div id="outline-container-org3ae4ad0" class="outline-3">
<h3 id="org3ae4ad0">Q120. What is hinted handoff?</h3>
<div class="outline-text-3" id="text-org3ae4ad0">
<p>
When a replica is down during a write, a coordinator stores a "hint" and replays
it when the node returns, improving availability and convergence.
</p>
</div>
</div>
<div id="outline-container-orgf69a7a9" class="outline-3">
<h3 id="orgf69a7a9">Q121. What is a "last write wins" conflict resolution?</h3>
<div class="outline-text-3" id="text-orgf69a7a9">
<p>
Cassandra resolves conflicting writes using cell timestamps — the write with the
latest timestamp wins. This can silently lose data under clock skew or concurrent
updates.
</p>
</div>
</div>
