org/posts/no-sql.org
** Q122. What is the difference between HBase and Cassandra?
HBase is CP, master-based, built on HDFS, strongly consistent, good for
random read/write on Hadoop data. Cassandra is AP, masterless, tunable
consistency, better for multi-DC availability and write-heavy workloads.

** Q123. What is a column family vs a super column?
A *column family* groups related columns under a row key. *Super columns*
(legacy) nest columns within columns; they're deprecated in favor of composite
keys and collections.

** Q124. What collection types does Cassandra support?
=set=, =list=, =map=, and user-defined types (UDTs). Useful for small bounded
collections; large collections hurt performance and should be modeled as
separate rows.

** Q125. What is a materialized view in Cassandra?
A server-maintained table that automatically duplicates a base table with a
different primary key to support another query pattern. Use cautiously — they have
known consistency edge cases.

** Q126. What are secondary indexes' limitations in Cassandra?
They work per-node and can require scatter-gather across the cluster for
high-cardinality or non-partition-restricted queries, often performing poorly.
Prefer denormalized query tables or SASI/SAI indexes.

* Graph Databases (Neo4j-focused)
** Q127. What is a property graph model?
A model of *nodes* and *relationships*, both of which can carry *properties* (key-value pairs) and *labels*/*types*.
Relationships are directed and first-class, with their own properties.

** Q128. What is Cypher?
Neo4j's declarative graph query language using ASCII-art patterns to match nodes and relationships:

#+begin_src cypher
MATCH (a:Person)-[:FRIEND]->(b:Person) WHERE a.name = 'Ada' RETURN b.name;
#+end_src

** Q129. How do you create nodes and relationships in Cypher?
#+begin_src cypher
CREATE (a:Person {name: 'Ada'})
CREATE (b:Person {name: 'Alan'})
CREATE (a)-[:FRIEND {since: 2020}]->(b);
#+end_src

** Q130. What problems are graph databases best for?
Highly connected data and relationship-centric queries: social networks,
recommendations, fraud detection, network/IT topology, knowledge graphs, and
shortest-path problems.

** Q131. Why are graph DBs faster than relational for deep traversals?
They use "index-free adjacency": each node directly references its neighbors, so
traversing relationships is O(1) per hop, avoiding the costly repeated joins
relational DBs need for multi-hop queries.

** Q132. What is index-free adjacency?
A storage approach where nodes store direct pointers to adjacent nodes/edges, so
relationship traversal doesn't require index lookups — the core graph-DB
performance advantage.

** Q133. How do you find shortest paths in Cypher?
#+begin_src cypher

MATCH p = shortestPath((a:Person {name:'Ada'})-[:KNOWS*]-(b:Person {name:'Grace'}))
RETURN p;

#+end_src

** Q134. What is a variable-length / multi-hop traversal?
A pattern matching a range of relationship hops, e.g., =[:KNOWS*1..3]= matches
friends up to 3 degrees away — concise traversal that's awkward in SQL.

** Q135. What is the difference between a property graph and RDF/triple store?
Property graphs attach properties to nodes/edges and use labels. RDF models data
as subject-predicate-object *triples* with global URIs, queried via SPARQL —
favored for linked/semantic web data.

** Q136. What is MERGE in Cypher?
A get-or-create operation: matches an existing pattern or creates it if absent,
useful for idempotent upserts and avoiding duplicate nodes.

** Q137. How are graph databases typically scaled?
Harder to shard than other models due to traversals crossing partitions. Options:
read replicas, caching, careful partitioning (e.g., by community), or
distributed graph engines (JanusGraph, Neptune, TigerGraph).

** Q138. What is a common graph use case: recommendations?
"People who bought X also bought Y" via traversing purchase relationships, or
collaborative filtering through shared-connection patterns — natural and fast in a graph.

** Q139. What does ACID look like in Neo4j?
Neo4j (in its core/clustered forms) provides full ACID transactions, unusual
among NoSQL — making it suitable when relationship integrity must be strong.

** Q140. What is a graph projection / GDS library?
Neo4j's Graph Data Science library runs algorithms (PageRank, community
detection, centrality, similarity) on in-memory graph projections for analytics
and ML feature generation.

** Q141. When should you NOT use a graph database?
For simple key-value lookups, bulk aggregations/analytics over flat data, or
write-heavy non-relational workloads — other models scale and perform better there.

* Consistency, Distribution & Internals
** Q142. What is quorum-based consistency?
Requiring acknowledgment from a quorum (majority) of replicas for reads/writes.
With =R + W > N=, read and write quorums overlap, guaranteeing the latest write is seen.

** Q143. What is the R + W > N formula?
With N replicas, requiring W write-acks and R read-replicas where R + W > N
ensures overlap and strong consistency. Tune R/W to trade latency vs consistency.

** Q144. What is a vector clock?
A data structure tracking causal ordering of events across nodes (a counter per node).
Used (e.g., in Dynamo/Riak) to detect concurrent updates and conflicts that need resolution.

** Q145. What is a conflict and how is it resolved?
When concurrent writes produce divergent replica states. Resolution strategies:
last-write-wins (timestamps), vector-clock sibling reconciliation, app-level merge logic, or CRDTs.

** Q146. What are CRDTs?
Conflict-free Replicated Data Types — data structures (counters, sets, maps)
mathematically designed to merge concurrent updates deterministically without
coordination, guaranteeing convergence. Used in Riak, Redis (active-active), Azure Cosmos DB.

