public/posts/no-sql.html
<div id="outline-container-org5467319" class="outline-3">
<h3 id="org5467319">Q122. What is the difference between HBase and Cassandra?</h3>
<div class="outline-text-3" id="text-org5467319">
<p>
HBase is CP, master-based, built on HDFS, strongly consistent, good for
random read/write on Hadoop data. Cassandra is AP, masterless, tunable
consistency, better for multi-DC availability and write-heavy workloads.
</p>
</div>
</div>
<div id="outline-container-orga5c02f1" class="outline-3">
<h3 id="orga5c02f1">Q123. What is a column family vs a super column?</h3>
<div class="outline-text-3" id="text-orga5c02f1">
<p>
A <b>column family</b> groups related columns under a row key. <b>Super columns</b>
(legacy) nest columns within columns; they're deprecated in favor of composite
keys and collections.
</p>
</div>
</div>
<div id="outline-container-org9edf479" class="outline-3">
<h3 id="org9edf479">Q124. What collection types does Cassandra support?</h3>
<div class="outline-text-3" id="text-org9edf479">
<p>
<code>set</code>, <code>list</code>, <code>map</code>, and user-defined types (UDTs). Useful for small bounded
collections; large collections hurt performance and should be modeled as
separate rows.
</p>
</div>
</div>
<div id="outline-container-orgb3fe575" class="outline-3">
<h3 id="orgb3fe575">Q125. What is a materialized view in Cassandra?</h3>
<div class="outline-text-3" id="text-orgb3fe575">
<p>
A server-maintained table that automatically duplicates a base table with a
different primary key to support another query pattern. Use cautiously — they have
known consistency edge cases.
</p>
</div>
</div>
<div id="outline-container-org52b5511" class="outline-3">
<h3 id="org52b5511">Q126. What are secondary indexes' limitations in Cassandra?</h3>
<div class="outline-text-3" id="text-org52b5511">
<p>
They work per-node and can require scatter-gather across the cluster for
high-cardinality or non-partition-restricted queries, often performing poorly.
Prefer denormalized query tables or SASI/SAI indexes.
</p>
</div>
</div>
</div>
<div id="outline-container-org77be06a" class="outline-2">
<h2 id="org77be06a">Graph Databases (Neo4j-focused)</h2>
<div class="outline-text-2" id="text-org77be06a">
</div>
<div id="outline-container-org757da2b" class="outline-3">
<h3 id="org757da2b">Q127. What is a property graph model?</h3>
<div class="outline-text-3" id="text-org757da2b">
<p>
A model of <b>nodes</b> and <b>relationships</b>, both of which can carry <b>properties</b> (key-value pairs) and <b>labels*/*types</b>.
Relationships are directed and first-class, with their own properties.
</p>
</div>
</div>
<div id="outline-container-org9739658" class="outline-3">
<h3 id="org9739658">Q128. What is Cypher?</h3>
<div class="outline-text-3" id="text-org9739658">
<p>
Neo4j's declarative graph query language using ASCII-art patterns to match nodes and relationships:
</p>

<div class="org-src-container">
<pre class="src src-cypher">MATCH (a:Person)-[:FRIEND]-&gt;(b:Person) WHERE a.name = 'Ada' RETURN b.name;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcaf4ddd" class="outline-3">
<h3 id="orgcaf4ddd">Q129. How do you create nodes and relationships in Cypher?</h3>
<div class="outline-text-3" id="text-orgcaf4ddd">
<div class="org-src-container">
<pre class="src src-cypher">CREATE (a:Person {name: 'Ada'})
CREATE (b:Person {name: 'Alan'})
CREATE (a)-[:FRIEND {since: 2020}]-&gt;(b);
</pre>
</div>
</div>
</div>
<div id="outline-container-org80b9bf5" class="outline-3">
<h3 id="org80b9bf5">Q130. What problems are graph databases best for?</h3>
<div class="outline-text-3" id="text-org80b9bf5">
<p>
Highly connected data and relationship-centric queries: social networks,
recommendations, fraud detection, network/IT topology, knowledge graphs, and
shortest-path problems.
</p>
</div>
</div>
<div id="outline-container-org5d0b22b" class="outline-3">
<h3 id="org5d0b22b">Q131. Why are graph DBs faster than relational for deep traversals?</h3>
<div class="outline-text-3" id="text-org5d0b22b">
<p>
They use "index-free adjacency": each node directly references its neighbors, so
traversing relationships is O(1) per hop, avoiding the costly repeated joins
relational DBs need for multi-hop queries.
</p>
</div>
</div>
<div id="outline-container-org8d8a85c" class="outline-3">
<h3 id="org8d8a85c">Q132. What is index-free adjacency?</h3>
<div class="outline-text-3" id="text-org8d8a85c">
<p>
A storage approach where nodes store direct pointers to adjacent nodes/edges, so
relationship traversal doesn't require index lookups — the core graph-DB
performance advantage.
</p>
</div>
</div>
<div id="outline-container-org2793ba1" class="outline-3">
<h3 id="org2793ba1">Q133. How do you find shortest paths in Cypher?</h3>
<div class="outline-text-3" id="text-org2793ba1">
<div class="org-src-container">
<pre class="src src-cypher">
MATCH p = shortestPath((a:Person {name:'Ada'})-[:KNOWS*]-(b:Person {name:'Grace'}))
RETURN p;

</pre>
</div>
</div>
</div>
<div id="outline-container-orge1bfe8f" class="outline-3">
<h3 id="orge1bfe8f">Q134. What is a variable-length / multi-hop traversal?</h3>
<div class="outline-text-3" id="text-orge1bfe8f">
<p>
A pattern matching a range of relationship hops, e.g., <code>[:KNOWS*1..3]</code> matches
friends up to 3 degrees away — concise traversal that's awkward in SQL.
</p>
</div>
</div>
<div id="outline-container-org64e7c54" class="outline-3">
<h3 id="org64e7c54">Q135. What is the difference between a property graph and RDF/triple store?</h3>
<div class="outline-text-3" id="text-org64e7c54">
<p>
Property graphs attach properties to nodes/edges and use labels. RDF models data
as subject-predicate-object <b>triples</b> with global URIs, queried via SPARQL —
favored for linked/semantic web data.
</p>
</div>
</div>
<div id="outline-container-org82bba9e" class="outline-3">
<h3 id="org82bba9e">Q136. What is MERGE in Cypher?</h3>
<div class="outline-text-3" id="text-org82bba9e">
<p>
A get-or-create operation: matches an existing pattern or creates it if absent,
useful for idempotent upserts and avoiding duplicate nodes.
</p>
</div>
</div>
<div id="outline-container-orgb6aaa5e" class="outline-3">
<h3 id="orgb6aaa5e">Q137. How are graph databases typically scaled?</h3>
<div class="outline-text-3" id="text-orgb6aaa5e">
<p>
Harder to shard than other models due to traversals crossing partitions. Options:
read replicas, caching, careful partitioning (e.g., by community), or
distributed graph engines (JanusGraph, Neptune, TigerGraph).
</p>
</div>
</div>
<div id="outline-container-orgabf48da" class="outline-3">
<h3 id="orgabf48da">Q138. What is a common graph use case: recommendations?</h3>
<div class="outline-text-3" id="text-orgabf48da">
<p>
"People who bought X also bought Y" via traversing purchase relationships, or
collaborative filtering through shared-connection patterns — natural and fast in a graph.
</p>
</div>
</div>
<div id="outline-container-org626c6a9" class="outline-3">
<h3 id="org626c6a9">Q139. What does ACID look like in Neo4j?</h3>
<div class="outline-text-3" id="text-org626c6a9">
<p>
Neo4j (in its core/clustered forms) provides full ACID transactions, unusual
among NoSQL — making it suitable when relationship integrity must be strong.
</p>
</div>
</div>
<div id="outline-container-orgfca6f4b" class="outline-3">
<h3 id="orgfca6f4b">Q140. What is a graph projection / GDS library?</h3>
<div class="outline-text-3" id="text-orgfca6f4b">
<p>
Neo4j's Graph Data Science library runs algorithms (PageRank, community
detection, centrality, similarity) on in-memory graph projections for analytics
and ML feature generation.
</p>
</div>
</div>
<div id="outline-container-org6561d51" class="outline-3">
<h3 id="org6561d51">Q141. When should you NOT use a graph database?</h3>
<div class="outline-text-3" id="text-org6561d51">
<p>
For simple key-value lookups, bulk aggregations/analytics over flat data, or
write-heavy non-relational workloads — other models scale and perform better there.
</p>
</div>
</div>
</div>
<div id="outline-container-orgb568a8a" class="outline-2">
<h2 id="orgb568a8a">Consistency, Distribution &amp; Internals</h2>
<div class="outline-text-2" id="text-orgb568a8a">
</div>
<div id="outline-container-org7e53ecc" class="outline-3">
<h3 id="org7e53ecc">Q142. What is quorum-based consistency?</h3>
<div class="outline-text-3" id="text-org7e53ecc">
<p>
Requiring acknowledgment from a quorum (majority) of replicas for reads/writes.
With <code>R + W &gt; N</code>, read and write quorums overlap, guaranteeing the latest write is seen.
</p>
</div>
</div>
<div id="outline-container-org42cfd1d" class="outline-3">
<h3 id="org42cfd1d">Q143. What is the R + W &gt; N formula?</h3>
<div class="outline-text-3" id="text-org42cfd1d">
<p>
With N replicas, requiring W write-acks and R read-replicas where R + W &gt; N
ensures overlap and strong consistency. Tune R/W to trade latency vs consistency.
</p>
</div>
</div>
<div id="outline-container-orgbeb7626" class="outline-3">
<h3 id="orgbeb7626">Q144. What is a vector clock?</h3>
<div class="outline-text-3" id="text-orgbeb7626">
<p>
A data structure tracking causal ordering of events across nodes (a counter per node).
Used (e.g., in Dynamo/Riak) to detect concurrent updates and conflicts that need resolution.
</p>
</div>
</div>
<div id="outline-container-org8beb644" class="outline-3">
<h3 id="org8beb644">Q145. What is a conflict and how is it resolved?</h3>
<div class="outline-text-3" id="text-org8beb644">
<p>
When concurrent writes produce divergent replica states. Resolution strategies:
last-write-wins (timestamps), vector-clock sibling reconciliation, app-level merge logic, or CRDTs.
</p>
</div>
</div>
<div id="outline-container-org3602e2c" class="outline-3">
<h3 id="org3602e2c">Q146. What are CRDTs?</h3>
<div class="outline-text-3" id="text-org3602e2c">
<p>
Conflict-free Replicated Data Types — data structures (counters, sets, maps)
mathematically designed to merge concurrent updates deterministically without
coordination, guaranteeing convergence. Used in Riak, Redis (active-active), Azure Cosmos DB.
</p>
</div>
</div>
