public/posts/no-sql.html
<div id="outline-container-org76787d9" class="outline-3">
<h3 id="org76787d9">Q147. What is the Dynamo paper's influence?</h3>
<div class="outline-text-3" id="text-org76787d9">
<p>
Amazon's 2007 Dynamo paper introduced consistent hashing, vector clocks, quorums,
hinted handoff, and gossip — foundational to Cassandra, Riak, and DynamoDB.
</p>
</div>
</div>
<div id="outline-container-org2ac1575" class="outline-3">
<h3 id="org2ac1575">Q148. What is consistent hashing?</h3>
<div class="outline-text-3" id="text-org2ac1575">
<p>
A hashing scheme mapping keys and nodes onto a ring so that adding/removing a node
only remaps a small fraction of keys (≈1/N), minimizing data movement on cluster changes.
</p>
</div>
</div>
<div id="outline-container-orge318267" class="outline-3">
<h3 id="orge318267">Q149. What are virtual nodes (vnodes)?</h3>
<div class="outline-text-3" id="text-orge318267">
<p>
Splitting each physical node into many token ranges on the ring, improving load
balance and making rebalancing smoother when nodes join/leave.
</p>
</div>
</div>
<div id="outline-container-org03abd12" class="outline-3">
<h3 id="org03abd12">Q150. What is a gossip protocol?</h3>
<div class="outline-text-3" id="text-org03abd12">
<p>
A decentralized protocol where nodes periodically exchange state with random
peers, propagating membership and health info across the cluster without a central coordinator.
</p>
</div>
</div>
<div id="outline-container-orgf6f78f1" class="outline-3">
<h3 id="orgf6f78f1">Q151. What is a Merkle tree and its role?</h3>
<div class="outline-text-3" id="text-orgf6f78f1">
<p>
A hash tree summarizing data ranges so replicas can efficiently compare and
identify differences with minimal data transfer — used for anti-entropy repair in Cassandra/Dynamo.
</p>
</div>
</div>
<div id="outline-container-org43d5020" class="outline-3">
<h3 id="org43d5020">Q152. What is anti-entropy repair?</h3>
<div class="outline-text-3" id="text-org43d5020">
<p>
A background process comparing replicas (via Merkle trees) and reconciling
differences to ensure replicas converge, complementing read repair and hinted handoff.
</p>
</div>
</div>
<div id="outline-container-orga076fb1" class="outline-3">
<h3 id="orga076fb1">Q153. What is read-your-own-writes consistency?</h3>
<div class="outline-text-3" id="text-orga076fb1">
<p>
A session guarantee that a client always sees its own prior writes, even under
eventual consistency — often achieved by routing the client to the same
replica/primary or via sticky sessions.
</p>
</div>
</div>
<div id="outline-container-org12f6518" class="outline-3">
<h3 id="org12f6518">Q154. What is monotonic read consistency?</h3>
<div class="outline-text-3" id="text-org12f6518">
<p>
A guarantee that once a client reads a value, subsequent reads never return older
values — preventing "going back in time" across replicas.
</p>
</div>
</div>
<div id="outline-container-orgfe027e0" class="outline-3">
<h3 id="orgfe027e0">Q155. What is causal consistency?</h3>
<div class="outline-text-3" id="text-orgfe027e0">
<p>
A model preserving cause-effect ordering: operations causally related are seen in
order by all nodes, while concurrent operations may be seen in any order. Stronger
than eventual, weaker than strong.
</p>
</div>
</div>
<div id="outline-container-orgce12225" class="outline-3">
<h3 id="orgce12225">Q156. What is the PACELC theorem?</h3>
<div class="outline-text-3" id="text-orgce12225">
<p>
An extension of CAP: if there is a Partition, trade Availability vs Consistency (A/C);
Else (normal operation) trade Latency vs Consistency (L/C). It captures the latency cost of consistency even without partitions.
</p>
</div>
</div>
<div id="outline-container-orgc36e570" class="outline-3">
<h3 id="orgc36e570">Q157. What is a write-ahead log (WAL) / commit log?</h3>
<div class="outline-text-3" id="text-orgc36e570">
<p>
A durable append-only log of changes written before applying them to main
storage, enabling crash recovery. Used in Cassandra (commit log), HBase (WAL),
and many engines.
</p>
</div>
</div>
<div id="outline-container-org86b3535" class="outline-3">
<h3 id="org86b3535">Q158. What is an LSM tree?</h3>
<div class="outline-text-3" id="text-org86b3535">
<p>
Log-Structured Merge tree — buffers writes in memory (memtable), flushes sorted
immutable files (SSTables) to disk, and merges them via compaction. Optimizes
write throughput; used by Cassandra, HBase, RocksDB, LevelDB.
</p>
</div>
</div>
<div id="outline-container-orgb53b21f" class="outline-3">
<h3 id="orgb53b21f">Q159. How does an LSM tree differ from a B-tree?</h3>
<div class="outline-text-3" id="text-orgb53b21f">
<p>
B-trees update in place (read-optimized, good for random reads, more write
amplification on random writes). LSM trees append/merge (write-optimized, need
compaction, reads may check multiple SSTables + bloom filters).
</p>
</div>
</div>
<div id="outline-container-orgc67242a" class="outline-3">
<h3 id="orgc67242a">Q160. What is a bloom filter and its role in NoSQL?</h3>
<div class="outline-text-3" id="text-orgc67242a">
<p>
A space-efficient probabilistic structure answering "is this key possibly present?" with no false negatives.
NoSQL stores use it to skip SSTables that can't contain a key, speeding reads.
</p>
</div>
</div>
<div id="outline-container-org3c1616e" class="outline-3">
<h3 id="org3c1616e">Q161. What is write amplification?</h3>
<div class="outline-text-3" id="text-org3c1616e">
<p>
The ratio of physical bytes written to logical bytes written. LSM compaction
rewrites data multiple times, increasing write amplification — a key tuning concern on SSDs.
</p>
</div>
</div>
<div id="outline-container-org1cdf6e1" class="outline-3">
<h3 id="org1cdf6e1">Q162. What is read amplification?</h3>
<div class="outline-text-3" id="text-org1cdf6e1">
<p>
Extra reads needed to satisfy a query (e.g., checking multiple SSTables + indexes
</p>

<ul class="org-ul">
<li>bloom filters in an LSM store). Mitigated by compaction strategy and bloom filters.</li>
</ul>
</div>
</div>
<div id="outline-container-org0ca6966" class="outline-3">
<h3 id="org0ca6966">Q163. What is space amplification?</h3>
<div class="outline-text-3" id="text-org0ca6966">
<p>
Extra disk used beyond the logical data size (obsolete versions, tombstones
awaiting compaction). LSM stores trade space amplification for write performance.
</p>
</div>
</div>
<div id="outline-container-org2e14d5d" class="outline-3">
<h3 id="org2e14d5d">Q164. What is the difference between synchronous and asynchronous replication?</h3>
<div class="outline-text-3" id="text-org2e14d5d">
<p>
<b>Synchronous</b>: write acknowledged only after replicas confirm (stronger
consistency, higher latency). <b>Asynchronous</b>: primary acks immediately, replicates
in background (lower latency, risk of data loss on failure).
</p>
</div>
</div>
<div id="outline-container-orgcf7304b" class="outline-3">
<h3 id="orgcf7304b">Q165. What is a split-brain scenario?</h3>
<div class="outline-text-3" id="text-orgcf7304b">
<p>
When a network partition causes two sides to each believe they're the
master/leader, accepting conflicting writes. Prevented via quorum/fencing and
leader election with majority.
</p>
</div>
</div>
<div id="outline-container-orgc52fed6" class="outline-3">
<h3 id="orgc52fed6">Q166. What is leader election and where is it used?</h3>
<div class="outline-text-3" id="text-orgc52fed6">
<p>
A process to choose a single coordinator among nodes (via consensus like Raft or Paxos).
Used by MongoDB replica sets, Kafka controllers, and Zookeeper-coordinated systems.
</p>
</div>
</div>
<div id="outline-container-org6fe9b10" class="outline-3">
<h3 id="org6fe9b10">Q167. What is the difference between Raft and Paxos?</h3>
<div class="outline-text-3" id="text-org6fe9b10">
<p>
Both are consensus algorithms for agreeing on a value/log across nodes despite
failures. Raft is designed for understandability (clear leader, log replication);
Paxos is older and notoriously harder to implement.
</p>
</div>
</div>
</div>
<div id="outline-container-org1970060" class="outline-2">
<h2 id="org1970060">Operations, Security &amp; Advanced</h2>
<div class="outline-text-2" id="text-org1970060">
</div>
<div id="outline-container-orgace71ba" class="outline-3">
<h3 id="orgace71ba">Q168. How do you back up NoSQL databases?</h3>
<div class="outline-text-3" id="text-orgace71ba">
<p>
Snapshots (Cassandra <code>nodetool snapshot</code>, MongoDB filesystem/mongodump),
continuous/PITR (DynamoDB PITR, MongoDB oplog-based), or managed-service backups.
Test restores regularly.
</p>
</div>
</div>
<div id="outline-container-org2fbcb2c" class="outline-3">
<h3 id="org2fbcb2c">Q169. What is mongodump/mongorestore vs filesystem snapshot?</h3>
<div class="outline-text-3" id="text-org2fbcb2c">
<p>
<code>mongodump</code> exports BSON logically (portable, slower, larger). Filesystem/volume
snapshots are faster for large datasets and support consistent point-in-time
backups (with journaling) but are storage-specific.
</p>
</div>
</div>
<div id="outline-container-org75ec8dc" class="outline-3">
<h3 id="org75ec8dc">Q170. How do you monitor a NoSQL cluster?</h3>
<div class="outline-text-3" id="text-org75ec8dc">
<p>
Track latency (p99), throughput, error rates, replication lag, disk/memory usage,
compaction/GC, hot partitions, and node health — via Prometheus/Grafana, native
tools (<code>nodetool</code>), or managed dashboards.
</p>
</div>
</div>
<div id="outline-container-orgd55f3b1" class="outline-3">
<h3 id="orgd55f3b1">Q171. What is replication lag and why does it matter?</h3>
<div class="outline-text-3" id="text-orgd55f3b1">
<p>
The delay before a write propagates to replicas. High lag means stale reads from
secondaries and risk of data loss on failover — monitor and bound it.
</p>
</div>
</div>
