public/posts/no-sql.html
<div id="outline-container-org2ad2b19" class="outline-3">
<h3 id="org2ad2b19">Q172. How do you secure a NoSQL database?</h3>
<div class="outline-text-3" id="text-org2ad2b19">
<p>
Enable authentication/authorization (RBAC), TLS in transit, encryption at rest,
network isolation (VPC/firewall), least-privilege accounts, audit logging, and
disable default open binds (a common breach cause).
</p>
</div>
</div>
<div id="outline-container-org1fb6a91" class="outline-3">
<h3 id="org1fb6a91">Q173. What is the "NoSQL injection" risk?</h3>
<div class="outline-text-3" id="text-org1fb6a91">
<p>
Injecting malicious operators/queries (e.g., MongoDB <code>$where</code>, <code>$ne</code>, or
JSON/object injection) when user input is passed unsanitized into queries.
Mitigate with parameterization, input validation, and avoiding =$where=/eval.
</p>
</div>
</div>
<div id="outline-container-orgdc429f0" class="outline-3">
<h3 id="orgdc429f0">Q174. How do you handle large-scale data migration in NoSQL?</h3>
<div class="outline-text-3" id="text-orgdc429f0">
<p>
Dual-write to old and new schemas, backfill historically in batches, verify with
reconciliation, then cut over reads. Use change streams/CDC and version fields to
migrate without downtime.
</p>
</div>
</div>
<div id="outline-container-org9226379" class="outline-3">
<h3 id="org9226379">Q175. What is change data capture (CDC) in NoSQL?</h3>
<div class="outline-text-3" id="text-org9226379">
<p>
Streaming row/document-level changes out of the database (MongoDB change streams,
DynamoDB Streams, Debezium, Cassandra CDC) to power search indexes, caches, data
lakes, and event-driven services.
</p>
</div>
</div>
<div id="outline-container-orga78dbee" class="outline-3">
<h3 id="orga78dbee">Q176. How do you integrate NoSQL with search engines?</h3>
<div class="outline-text-3" id="text-orga78dbee">
<p>
Stream changes via CDC into Elasticsearch/OpenSearch for full-text and analytical
queries the primary store handles poorly, keeping the index eventually consistent
with the source of truth.
</p>
</div>
</div>
<div id="outline-container-orgeafdec5" class="outline-3">
<h3 id="orgeafdec5">Q177. What is a Lambda vs Kappa architecture?</h3>
<div class="outline-text-3" id="text-orgeafdec5">
<p>
<b>Lambda</b>: separate batch and speed layers merged at query time. <b>Kappa</b>: a single
stream-processing pipeline reprocessed as needed. Both use NoSQL/streaming stores
for serving and ingest.
</p>
</div>
</div>
<div id="outline-container-orge030fc4" class="outline-3">
<h3 id="orge030fc4">Q178. What is data locality in distributed NoSQL?</h3>
<div class="outline-text-3" id="text-orge030fc4">
<p>
Placing data (and computation) close to where it's accessed — within a partition,
node, datacenter, or region — to minimize cross-network latency. Multi-region
configs use <code>LOCAL_QUORUM</code> and geo-partitioning.
</p>
</div>
</div>
<div id="outline-container-org08d8441" class="outline-3">
<h3 id="org08d8441">Q179. How do multi-region/global NoSQL deployments work?</h3>
<div class="outline-text-3" id="text-org08d8441">
<p>
Data is replicated across regions (active-passive or active-active). Active-active
(DynamoDB Global Tables, Cosmos DB, Cassandra multi-DC) needs conflict resolution
(LWW/CRDTs) and accepts eventual cross-region consistency.
</p>
</div>
</div>
<div id="outline-container-org1e7b66f" class="outline-3">
<h3 id="org1e7b66f">Q180. What is the difference between OLTP and OLAP needs in NoSQL?</h3>
<div class="outline-text-3" id="text-org1e7b66f">
<p>
Most NoSQL stores target OLTP (fast point/partition operations). Analytical (OLAP)
queries are offloaded to columnar/warehouse systems (BigQuery, Redshift, Spark) or
search engines via ETL/CDC.
</p>
</div>
</div>
<div id="outline-container-org8d567ce" class="outline-3">
<h3 id="org8d567ce">Q181. What is idempotency and why does it matter for NoSQL writes?</h3>
<div class="outline-text-3" id="text-org8d567ce">
<p>
An idempotent operation produces the same result if applied multiple times. With
at-least-once delivery and retries common in distributed systems, idempotent
writes (e.g., set by id, conditional writes) prevent duplicates/double-counting.
</p>
</div>
</div>
<div id="outline-container-orgd3472ce" class="outline-3">
<h3 id="orgd3472ce">Q182. What are conditional writes / optimistic concurrency in NoSQL?</h3>
<div class="outline-text-3" id="text-orgd3472ce">
<p>
Writes that succeed only if a condition holds (e.g., DynamoDB <code>ConditionExpression</code>,
a version attribute, or MongoDB <code>findAndModify</code> on a version). Used to implement
optimistic locking without blocking.
</p>
</div>
</div>
<div id="outline-container-org1f1e0d7" class="outline-3">
<h3 id="org1f1e0d7">Q183. How do you implement counters at scale?</h3>
<div class="outline-text-3" id="text-org1f1e0d7">
<p>
Atomic increments (Redis <code>INCR</code>, DynamoDB <code>ADD</code>, Cassandra counter columns). For
extreme write rates, shard counters across keys and sum on read to avoid hot keys.
</p>
</div>
</div>
<div id="outline-container-org5077d5e" class="outline-3">
<h3 id="org5077d5e">Q184. What is the dual-write problem?</h3>
<div class="outline-text-3" id="text-org5077d5e">
<p>
Writing to two systems (e.g., DB + cache or DB + search) without atomicity, risking
inconsistency if one write fails. Solve with the outbox pattern + CDC rather than
naive dual writes.
</p>
</div>
</div>
<div id="outline-container-orgcb1b757" class="outline-3">
<h3 id="orgcb1b757">Q185. What is the outbox pattern?</h3>
<div class="outline-text-3" id="text-orgcb1b757">
<p>
Writing events to an "outbox" table/collection in the same transaction as the data
change, then a separate process publishes them — guaranteeing the event and the
state change are consistent (no lost or phantom events).
</p>
</div>
</div>
<div id="outline-container-org90793c4" class="outline-3">
<h3 id="org90793c4">Q186. What is eventual consistency's impact on application design?</h3>
<div class="outline-text-3" id="text-org90793c4">
<p>
Apps must tolerate stale reads, design idempotent operations, handle conflicts,
avoid read-after-write assumptions (or use session consistency), and surface
"pending" states to users where appropriate.
</p>
</div>
</div>
<div id="outline-container-org99e020e" class="outline-3">
<h3 id="org99e020e">Q187. How do you choose between document, key-value, column, and graph stores?</h3>
<div class="outline-text-3" id="text-org99e020e">
<p>
Map to access patterns: rich nested records/flexible queries → document; simple
fast lookups/cache → key-value; massive write-heavy time-series/known-query →
wide-column; relationship traversal → graph.
</p>
</div>
</div>
<div id="outline-container-org5d1a97f" class="outline-3">
<h3 id="org5d1a97f">Q188. What is a "polystore" / multi-model database?</h3>
<div class="outline-text-3" id="text-org5d1a97f">
<p>
A database supporting multiple models in one engine (e.g., Cosmos DB, ArangoDB,
Couchbase, OrientDB), reducing operational overhead of running several specialized stores.
</p>
</div>
</div>
<div id="outline-container-orgf0e7511" class="outline-3">
<h3 id="orgf0e7511">Q189. What are common anti-patterns in NoSQL?</h3>
<div class="outline-text-3" id="text-orgf0e7511">
<p>
Treating NoSQL like SQL (normalizing everything, joining in app code), unbounded
array/partition growth, low-cardinality partition keys, scanning instead of
querying, ignoring access patterns, and using eventual consistency where strong is required.
</p>
</div>
</div>
<div id="outline-container-org8de5d57" class="outline-3">
<h3 id="org8de5d57">Q190. How do you test and benchmark NoSQL systems?</h3>
<div class="outline-text-3" id="text-org8de5d57">
<p>
Use realistic workloads and tools like YCSB (Yahoo! Cloud Serving Benchmark),
measure p99 latency and throughput under concurrency, test failure/partition
scenarios, and validate consistency behavior — not just averages.
</p>
</div>
</div>
<div id="outline-container-org59e5bfb" class="outline-3">
<h3 id="org59e5bfb">Q191. What is the future direction of NoSQL ("NewSQL" and convergence)?</h3>
<div class="outline-text-3" id="text-org59e5bfb">
<p>
The line is blurring: NewSQL systems (CockroachDB, Spanner, YugabyteDB, TiDB)
offer SQL + horizontal scale + distributed ACID, while NoSQL stores add
transactions, SQL-like languages, and stronger consistency — converging on "distributed SQL".
</p>

<hr>

<div class="site-footer">
    <ul class="social-icons">
        <li><a href="https://github.com/bdostumski" rel="nofollow noopener noreferrer"><i class="fab fa-fw fa-github" aria-hidden="true"></i> GitHub</a></li>
        <li><a href="https://www.linkedin.com/in/borislav-dostumski/" rel="nofollow noopener noreferrer"><i class="fab fa-linux" aria-hidden="true"></i> LinkedIn</a></li>
        <li><a href="https://www.youtube.com/@borislavdostumski6006" rel="nofollow noopener noreferrer"><i class="fab fa-linux" aria-hidden="true"></i> YouTube</a></li>
    </ul>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
